cf/BusinessProcesses/ВнутренняяЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ВнутренняяЗаявка</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/AccumulationRegisters/ТоварыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Резерв</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ВнутренниеЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ВнутренниеЗаказы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/СостоянияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСборку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСкладПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгруженЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобранЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьЗаявку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьИнструмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьГарантию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвестиДефектовку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьНаСкладВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредупредитьКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПоТехническимПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Когда товар отправлен в доставку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
					<Comment>Когда товар принял получатель или транспортная компания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/КорректировкаВнутреннегоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаВнутреннегоЗаказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ОтгруженныеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДвиженийПоРезерву</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/BusinessProcesses/ВнутренняяЗаявка/Ext/ObjectModule.bsl
Функция ПредставлениеЗадачи(Задача)
	
	Заказ = Задача.БизнесПроцесс.Заказ;
    
	НомерЗаказа   = СокрЛП(Заказ.Номер);
	Пока Лев(НомерЗаказа, 1)="0" Цикл   			  // удаление ведущих нулей
		НомерЗаказа = Сред(НомерЗаказа, 2);
	КонецЦикла;

	Возврат Задача.Наименование + " № "  + НомерЗаказа + " (переместить " + Заказ.Склад + " -> " + Заказ.Заказчик + ")";
	
КонецФункции  


Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.Черновик) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ФормированиеЗаказаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.ВРаботе) Тогда
			
		Отказ = Истина;
			
	КонецЕсли;
	
	// Если впереди уже есть невыполненая задача сборки тогда установим ей статус выполненной
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР КОГДА Выполнена ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) Выполненных,
	|	СУММА(ВЫБОР КОГДА Выполнена ТОГДА 0 ИНАЧЕ 1 КОНЕЦ) НеВыполненных
	|ИЗ			Задача.ЗадачаПользователю
	|ГДЕ		БизнесПроцесс = &БизнесПроцесс
	//|	Не Выполнена И
	//|	Не ПометкаУдаления И
	//|	ТочкаМаршрута = &ТочкаСборкаЗаказа
	|");
	
	Запрос.УстановитьПараметр("БизнесПроцесс", 		Ссылка);
	//Запрос.УстановитьПараметр("ТочкаСборкаЗаказа", 	БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.СборкаЗаказа);
	//Запрос.УстановитьПараметр("ТочкаСборкаЗаказа", 	БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.ФормированиеЗаказа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если 	Выборка.Следующий() И
			Выборка.Выполненных = 1 И
			Выборка.НеВыполненных = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ФормируемыеЗадачи.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры
Процедура ФормированиеЗаказаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	COMПользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("9178cb51-1157-11df-94a9-0015175303fd"));
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		
		Задача.Наименование = ПредставлениеЗадачи(Задача);
		Задача.Пользователь = ?(Заказ.Автор = COMПользователь, ПараметрыСеанса.ТекущийПользователь, Заказ.Автор);
		
	КонецЦикла;
	
КонецПроцедуры

// УСЛОВИЯ

Процедура УсловиеОтменыПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Заказы.ПолучитьСостояниеЗаказа(Заказ) = Перечисления.СостоянияЗаказа.Отменен;
	
КонецПроцедуры
Процедура УсловиеЗаказОтгруженПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Заказы.ЗаказОтработал(Заказ);
	
	Если Результат Тогда
	
		Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.Отгружен);
		
	КонецЕсли;
	
КонецПроцедуры

// ЗАКРЫТИЕ

Процедура ЗакрытиеЗаказаОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	// Делаем корректировку на все что осталось недозаказано
	
	//ТаблицаИзменений = КонвертацияТипов.ПолучитьТаблицуРазницуДокументаИРегистраОстатков(
	//						Документы.ВнутреннийЗаказ.СоздатьДокумент().Товары.Выгрузить(), 
	//						"ВнутренниеЗаказы",
	//						"Номенклатура, Упаковка, Размещение",
	//						"Количество",
	//						Новый Структура("ВнутреннийЗаказ", Заказ));
							
	
	
	//Новый алгоритм:
		
	
	
	// берем остатки резервов  
	// добавляем разницу между остатками заказа и резервами
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Запрос.Текст = "
	|Выбрать Номенклатура, Размещение, -КоличествоОстаток Количество из РегистрНакопления.ТоварыВРезерве.Остатки(,ДокументРезерва = &Заказ) 
	|
	|Объединить все
	|
	|Выбрать Зак.Номенклатура, Неопределено , -Зак.КоличествоОстаток + isnull(Рез.КоличествоОстаток,0)  из РегистрНакопления.ВнутренниеЗаказы.Остатки(,ВнутреннийЗаказ = &Заказ) Зак
	|Левое соединение
	|РегистрНакопления.ТоварыВРезерве.Остатки(,ДокументРезерва = &Заказ) Рез
	|По Зак.Номенклатура = Рез.Номенклатура
	|Где Зак.КоличествоОстаток - isnull(Рез.КоличествоОстаток,0) > 0
	|";
	
	
	ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
	
	
	
	Если ТаблицаИзменений.Количество() Тогда
		
		// Шапка
		
		НовДок = Документы.КорректировкаВнутреннегоЗаказа.СоздатьДокумент();
		НовДок.Заказ 	= Заказ;
		НовДок.Дата 	= ТекущаяДата();
		
		// Таблица
		
		НовДок.Товары.Загрузить(ТаблицаИзменений);
		
		// Проведение
		
		Если Не ПроведенияДокументов.ПровестиДокумент(НовДок) Тогда
			
			ВызватьИсключение
			"Ошибка формирования закрывающей корректировки заказа!";
			
		КонецЕсли;
		
		// Если были отгруженные товары тогда сделаем их отгруженными
		
		Если БизнесПроцессы.ВнутренняяЗаявка.ПолучитьТаблицуТоваров(Ссылка).Найти(Истина, "Отгружено") <> Неопределено Тогда
			Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.Отгружен);
		КонецЕсли;
		
	КонецЕсли;						
	
КонецПроцедуры

// СБОРКА

Процедура СборкаЗаказаПередСозданиемВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	
	НовПроцесс = БизнесПроцессы.СборкаЗаказа.СоздатьБизнесПроцесс();
	НовПроцесс.Дата 			= ТекущаяДата();
	//НовПроцесс.ДатаПервойСборки = БизнесПроцессы.СборкаЗаказа.ПолучитьДатуПервойСборкиЗаказа(Заказ);
	НовПроцесс.Заказ 			= Заказ;
	НовПроцесс.Склад 			= Заказ.Склад;
	НовПроцесс.ЯчеистаяСборка 	= Заказ.Склад.Ячеестый;
	
	ФормируемыеБизнесПроцессы.Добавить(НовПроцесс);
	
КонецПроцедуры

//Антон
////////////////////////////////////////
//Хитрая функция чтоб макет получить
Функция ПолучитьСхемуКомпоновки() Экспорт
	Возврат ПолучитьМакет("Схема");
КонецФункции
